HW10/Store/app/views/layouts/_sidebar.html.erb

  <ul class="nav nav-pills flex-column mb-auto">
    <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"