HW11/Store/app/controllers/categories_controller.rb

SELECT "products".* FROM "products" WHERE "products"."category_id" = $1  [["category_id", 2]]
---
  def show
    @title = @category.title
    @category = @category.products
    @product_id = @category.ids