HW7/Articles/app/controllers/api/v1/articles_controller.rb

  def fetch_comments
    @comment = Article.find params[:id].comments.published
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]