HW7/Articles/app/controllers/api/v1/articles_controller.rb

      def create
        @article = Article.new(articles_params)
        if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status", "author_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

      def published
        article = Article.published.find(params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def unpublished
        article = Article.unpublished.find(params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def change_status
        new_status = @articles.status == 'unpublished' ? 'published' : 'unpublished'
        @articles.update(status: new_status)
---
UPDATE "articles" SET "updated_at" = $1, "status" = $2 WHERE "articles"."id" = $3  [["updated_at", "2022-12-14 13:45:59.278715"], ["status", 1], ["id", 1]]

      def set_article
        @article = Article.find params[:id]
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

      def fetch_comments
        @comments = Article.find(params[:id]).comments.get_last_ten_comments
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def status
        @articles = Article.find params[:article_id]
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def fetch_tags
        @tags = Tag.find params[:id]
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def fetch_likes
        @likes = Like.find params[:id]
---
SELECT "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]