HW7/Articles/app/controllers/api/v1/articles_controller.rb

      def published
        article = Article.published.find(params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]