HW7/Articles/app/controllers/api/v1/authors_controller.rb

      def index
        @author = Author.all
---
SELECT "authors".* FROM "authors"