HW7/Articles/app/controllers/api/v1/comments_controller.rb

SELECT "comments".* FROM "comments"
---
      def index
        comment = Comment.all

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
---
      def destroy
        if @comment.destroy

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def published
        comments = Article.find(params[:comment_id]).comments.published

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def unpublished
        comments = Article.find(params[:comment_id]).comments.unpublished

UPDATE "comments" SET "status" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["status", 1], ["updated_at", "2022-12-14 14:19:10.321592"], ["id", 1]]
---
      def change_status
        new_status = @comments.status == 'unpublished' ? 'published' : 'unpublished'
        @comments.update(status: new_status)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
      def set_comment
        @comment = Comment.find params[:id]

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def status
        @comments = Comment.find params[:comment_id]