HW7/Articles/app/controllers/api/v1/likes_controller.rb

INSERT INTO "likes" ("author_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 10], ["likeable_type", "Article"], ["likeable_id", 1], ["created_at", "2022-12-14 14:04:51.902076"], ["updated_at", "2022-12-14 14:04:51.902076"]]
---
      def create
        @like = Like.new(like_params)
        @likeable = @like.likeable
        if @like.save

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 2]]
---
      def destroy
        if @like.destroy

SELECT "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      def set_like
        @like = Like.find params[:id]