HW6/Articles/app/controllers/api/v1/articles_controller.rb

  def show
    @comment = Article.find(params[:id]).comments.published
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["article_id", 3], ["id", 3], ["LIMIT", 1]]

  def set_article
    @article = Article.find params[:id]
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]