HW6/Articles/app/controllers/api/v1/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_article
    @articles = Article.find params[:id]