HW6/Articles/app/controllers/api/v1/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def index
    #@comment = Comment.all
    @comment = Comment.find params[:article_id]

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_comment
    @comment = Comment.find params[:id]