HW8/Articles/app/controllers/api/v1/authors_controller.rb

SELECT "authors".* FROM "authors"
---
      def index
        @author = Author.all