HW5/Articles/app/controllers/api/v1/articles_controller.rb

  def index
    articles = Article.all
---
SELECT "articles".* FROM "articles" ORDER BY created_at DESC

  def create
    articles = Articles.new(articles_params)

    if articles.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test article"], ["body", "same test body article"], ["created_at", "2022-11-19 21:22:20.339196"], ["updated_at", "2022-11-19 21:22:20.339196"]]

  def show
    articles = Articles.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def destroy
    articles = Articles.find(params[:id])

    if articles.destroy!
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 6]]